
#### Terraform Initialization ⚙️`success`
#### Terraform Format and Style 🖌`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`


<details><summary>Show Plan</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # random_id.datalake_name will be created
  + resource "random_id" "datalake_name" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + prefix      = "mlops-bootcamp-datalake"
    }

  # module.dev_users.data.aws_iam_policy_document.custom_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "custom_policy_document" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.dev_users.aws_iam_group.dev_group will be created
  + resource "aws_iam_group" "dev_group" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "dev-group"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # module.dev_users.aws_iam_policy.dev_policy will be created
  + resource "aws_iam_policy" "dev_policy" {
      + arn         = (known after apply)
      + description = "A custom policy for the dev group"
      + id          = (known after apply)
      + name        = "dev-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.dev_users.aws_iam_policy_attachment.dev_policy_attachment will be created
  + resource "aws_iam_policy_attachment" "dev_policy_attachment" {
      + groups     = [
          + "dev-group",
        ]
      + id         = (known after apply)
      + name       = "dev-policy"
      + policy_arn = (known after apply)
    }

  # module.dev_users.aws_iam_user.dev_user["hugo-ramirez"] will be created
  + resource "aws_iam_user" "dev_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "hugo-ramirez"
      + path          = "/"
      + tags          = {
          + "Name" = "Developer User: hugo-ramirez"
        }
      + tags_all      = {
          + "Name" = "Developer User: hugo-ramirez"
        }
      + unique_id     = (known after apply)
    }

  # module.dev_users.aws_iam_user.dev_user["ricardo-diaz"] will be created
  + resource "aws_iam_user" "dev_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "ricardo-diaz"
      + path          = "/"
      + tags          = {
          + "Name" = "Developer User: ricardo-diaz"
        }
      + tags_all      = {
          + "Name" = "Developer User: ricardo-diaz"
        }
      + unique_id     = (known after apply)
    }

  # module.dev_users.aws_iam_user_group_membership.dev_user_group_membership["hugo-ramirez"] will be created
  + resource "aws_iam_user_group_membership" "dev_user_group_membership" {
      + groups = [
          + "dev-group",
        ]
      + id     = (known after apply)
      + user   = "hugo-ramirez"
    }

  # module.dev_users.aws_iam_user_group_membership.dev_user_group_membership["ricardo-diaz"] will be created
  + resource "aws_iam_user_group_membership" "dev_user_group_membership" {
      + groups = [
          + "dev-group",
        ]
      + id     = (known after apply)
      + user   = "ricardo-diaz"
    }

  # module.s3_bucket_datalake.aws_s3_bucket.bucket will be created
  + resource "aws_s3_bucket" "bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.s3_bucket_datalake.aws_s3_bucket_server_side_encryption_configuration.bucket_encryption will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "bucket_encryption" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.s3_bucket_datalake.aws_s3_bucket_versioning.bucket_versioning will be created
  + resource "aws_s3_bucket_versioning" "bucket_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @trujillo9616*